# для astro_report
ZODIAC_SIGNS = [
    "Овен", "Телец", "Близнецы", "Рак", "Лев", "Дева",
    "Весы", "Скорпион", "Стрелец", "Козерог", "Водолей", "Рыбы"
]

nakshatra_name = [
        "Ашвини", "Бхарани", "Криттика", "Рохини", "Мригашира", "Ардра", "Пунарвасу",
        "Пушья", "Ашлеша", "Магха", "Пурва-Пхалгуни", "Уттара-Пхалгуни", "Хаста",
        "Читра", "Свати", "Вишакха", "Анурадха", "Джйештха", "Мула", "Пурва-Ашадха",
        "Уттара-Ашадха", "Шравана", "Дхаништха", "Шатабхиша", "Пурва-Бхадрапада",
        "Уттара-Бхадрапада", "Ревати"
    ]

 # for core_files
signs = [
        "Aries", "Taurus", "Gemini", "Cancer", "Leo", "Virgo",
        "Libra", "Scorpio", "Sagittarius", "Capricorn", "Aquarius", "Pisces"
    ]


# для блока jaimini
CHARA_KARAKA_ORDER = ["АК", "АмК", "БК", "МатК", "ПК", "ГнК", "ДК"]
EXCLUDED_PLANETS = ["Раху", "Кету", "Лагна"]  # Лагна исключаем из расчёта карак

# для lunar modul
nakshatra_lords = {
    "Ашвини": "Кету",
    "Бхарани": "Венера",
    "Криттика": "Солнце",
    "Рохини": "Луна",
    "Мригашира": "Марс",
    "Ардра": "Раху",
    "Пунарвасу": "Юпитер",
    "Пушья": "Сатурн",
    "Ашлеша": "Меркурий",
    "Магха": "Кету",
    "Пурва-Пхалгуни": "Венера",
    "Уттара-Пхалгуни": "Солнце",
    "Хаста": "Луна",
    "Читра": "Марс",
    "Свати": "Раху",
    "Вишакха": "Юпитер",
    "Анурадха": "Сатурн",
    "Джйештха": "Меркурий",
    "Мула": "Кету",
    "Пурва-Ашадха": "Венера",
    "Уттара-Ашадха": "Солнце",
    "Шравана": "Луна",
    "Дхаништха": "Марс",
    "Шатабхиша": "Раху",
    "Пурва-Бхадрапада": "Юпитер",
    "Уттара-Бхадрапада": "Сатурн",
    "Ревати": "Меркурий"
}

NAKSHATRAS = [
    "Ашвини", "Бхарани", "Криттика", "Рохини", "Мригашира", "Ардра", "Пунарвасу",
    "Пушья", "Ашлеша", "Магха", "Пурва-Пхалгуни", "Уттара-Пхалгуни", "Хаста",
    "Читра", "Свати", "Вишакха", "Анурадха", "Джйештха", "Мула", "Пурва-Ашадха",
    "Уттара-Ашадха", "Шравана", "Дхаништха", "Шатабхиша", "Пурва-Бхадрапада",
    "Уттара-Бхадрапада", "Ревати"
]

TITHIS = [
    "Пратхама", "Двитья", "Тритья", "Чатуртхи", "Панчами", "Шаштхи", "Саптами", "Аштами",
    "Навами", "Дашами", "Экадаши", "Двадаши", "Трайодащи", "Чатурдаши", "Пурнима/Амавасья"
]

PAKSHA_NAMES = {
    "shukla": "Шукла (светлая половина)",
    "krishna": "Кришна (тёмная половина)"
}
NAKSHATRA_LENGTH = 360 / 27

# for vimshotari block
VIMSHOTTARI_DURATIONS = [
    ("Кету", 7),
    ("Венера", 20),
    ("Солнце", 6),
    ("Луна", 10),
    ("Марс", 7),
    ("Раху", 18),
    ("Юпитер", 16),
    ("Сатурн", 19),
    ("Меркурий", 17)
]

YEAR_IN_DAYS = 365.25

# for arudha block
SIGN_RULERS = {
    "Овен": "Марс", "Телец": "Венера", "Близнецы": "Меркурий", "Рак": "Луна",
    "Лев": "Солнце", "Дева": "Меркурий", "Весы": "Венера", "Скорпион": "Марс",
    "Стрелец": "Юпитер", "Козерог": "Сатурн", "Водолей": "Сатурн", "Рыбы": "Юпитер"
}


# for chara

CHARA_DASHA_YEARS = [
    20, 17, 18, 19, 17, 16, 18, 20, 19, 17, 16, 18, 20, 19, 17, 18, 19, 17, 16, 18, 20, 19, 17, 16, 18, 20, 19
]


# for transit_analisis


benefic_planets = {"Юпитер", "Венера", "Меркурий", "Луна"}
malefic_planets = {"Сатурн", "Солнце", "Марс", "Раху", "Кету"}

trikon_houses = {1, 5, 9}
kendra_houses = {1, 4, 7, 10}
dusthana_houses = {6, 8, 12}


DRISHTI_MAP = {
        "Сатурн": [3, 7, 10],
        "Марс": [4, 7, 8],
        "Юпитер": [5, 7, 9],
        "Раху": [5,  9],
        "Кету": [],  # не аспектирует

        # Для остальных планет добавим только аспект на 7 дом (противоположный дом)
        "Солнце": [7],
        "Луна": [7],
        "Меркурий": [7],
        "Венера": [7],
    }

# for analsys

friendly_signs_map = {
    "Солнце": ["Лев", "Овен"],
    "Луна": ["Рак", "Телец"],
    "Марс": ["Овен", "Скорпион", "Козерог"],
    "Меркурий": ["Близнецы", "Дева"],
    "Юпитер": ["Стрелец", "Рыбы", "Рак"],
    "Венера": ["Телец", "Весы", "Рыбы"],
    "Сатурн": ["Козерог", "Водолей", "Весы"],
    "Раху": ["Телец"],          # экзальтационный знак
    "Кету": ["Скорпион"],       # экзальтационный знак
}

enemy_signs_map = {
    "Солнце": ["Водолей", "Козерог", "Весы"],
    "Луна": ["Водолей", "Козерог", "Скорпион"],
    "Марс": [ "Телец", "Весы", "Рак"],
    "Меркурий": [ "Рыбы"],
    "Юпитер": ["Близнецы", "Дева", "Козерог"],
    "Венера": ["Овен", "Скорпион", "Дева"],
    "Сатурн": [ "Лев", "Овен"],
    "Раху": ["Скорпион"],       # падительный знак
    "Кету": ["Телец"],          # падительный знак
}

HOUSE_MEANINGS = {
    1: "Личность, Здоровье, Самовыражение",
    2: "Семья, Финансы, Речь, Имущество",
    3: "Сила Воли, Братья, Смелость, Общение",
    4: "Дом, Мать, Комфорт, Внутренний Мир",
    5: "Творчество, Дети, Интеллект, Обучение",
    6: "Враги, Болезни, Долги, Служба",
    7: "Партнёрство, Брак, Публичные Отношения",
    8: "Трансформация, Смерть, Наследство",
    9: "Духовность, Учителя, Путешествия",
    10: "Карьера, Статус, Власть, Общество",
    11: "Друзья, Доходы, Желания",
    12: "Потери, Изоляция, Духовные Практики",
}
